src/cf/Enums/уатТипыОбъектовДляУведомлений_уэ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>уатТипыОбъектовДляУведомлений_уэ</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ЗаказНаТС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗаказПеревозчику</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МаршрутныйЛист</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПотребностьВПеревозке</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Тендер</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СтраховойСертификат</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АктПриемки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АктОтгрузки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СопроводительныйДокумент</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПакетСопроводительныхДокументов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗаказТакси</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АрендаТС</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Enums/уатТипыОбъектовДляУведомлений_уэ/Ext/ManagerModule.bsl
#Область ОбработчикиСобытий

Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ДанныеВыбора = Новый СписокЗначений();
	ДанныеВыбора.Добавить(Перечисления.уатТипыОбъектовДляУведомлений_уэ.ЗаказНаТС);
	ДанныеВыбора.Добавить(Перечисления.уатТипыОбъектовДляУведомлений_уэ.МаршрутныйЛист);
	ДанныеВыбора.Добавить(Перечисления.уатТипыОбъектовДляУведомлений_уэ.ТС);
	ДанныеВыбора.Добавить(Перечисления.уатТипыОбъектовДляУведомлений_уэ.СопроводительныйДокумент);  
	ДанныеВыбора.Добавить(Перечисления.уатТипыОбъектовДляУведомлений_уэ.ПакетСопроводительныхДокументов);
	Если уатОбщегоНазначенияПовтИсп.ВариантПоставкиТакси() Тогда
		ДанныеВыбора.Добавить(Перечисления.уатТипыОбъектовДляУведомлений_уэ.ЗаказТакси);
		ДанныеВыбора.Добавить(Перечисления.уатТипыОбъектовДляУведомлений_уэ.АрендаТС);
	Иначе 
		ДанныеВыбора.Добавить(Перечисления.уатТипыОбъектовДляУведомлений_уэ.ПотребностьВПеревозке);
		ДанныеВыбора.Добавить(Перечисления.уатТипыОбъектовДляУведомлений_уэ.ЗаказПеревозчику);
		ДанныеВыбора.Добавить(Перечисления.уатТипыОбъектовДляУведомлений_уэ.Тендер); 
		ДанныеВыбора.Добавить(Перечисления.уатТипыОбъектовДляУведомлений_уэ.СтраховойСертификат);
		ДанныеВыбора.Добавить(Перечисления.уатТипыОбъектовДляУведомлений_уэ.АктПриемки);
		ДанныеВыбора.Добавить(Перечисления.уатТипыОбъектовДляУведомлений_уэ.АктОтгрузки);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
